START_MESSAGE = (
    "👋 <b>Привет!</b>\n\n"
    'Давай попробуем сыграть в аналог игры <b>"Бункер" 🌋</b>\n'
)

SUPPORT_MESSAGE = (
    "Все пожелания и вопросы оставляйте пожалуйста по ссылке ниже"
)

ABOUT_MESSAGE = [
    (
        "🌋 На земле произошла <b>катастрофа. </b>\n\n"
        "🏚 Часть людей находится возле <b>спасительного бункера</b>,"
        "и каждый мечтает попасть в него и выжить.\n\n"
        "🚷 Но количество мест <b>ограничено</b>: в бункер попадет "
        "только половина, остальные останутся в гибнущем мире.\n\n"
        "🗳 Каждый круг проходит голосование, по которому участники решают, "
        "кто из людей попадет в бункер. \n\n"
        "🌏 Финалисты будут возрождать быт и население Земли. "
        "Игроки должны выбрать самых полезных людей для "
        "восстановления жизни на постапокаллиптической планете. "
        "Именно они попадут в бункер.\n\n"
    ),
    (
        "👤 У каждого персонажа есть набор <b>характеристик</b>:\n"
        "🎓 Профессия\n"
        "🧑‍🦲 Био характеристики\n"
        "🏥 Состояние здоровья\n"
        "🕷 Фобия\n"
        "🎯 Хобби\n"
        "😈 Характер\n"
        "ℹ️ Доп. Информация\n"
        "👝 Багаж\n\n"
        "👍 / 👎 По ним участники оценивают персонажа, "
        "насколько он будет полезен после выхода из бункера. Оружия и "
        "насилия нет, только дискуссия и обоснование своей важности и "
        "необходимости.\n\n"
        "↗️ Так же у игрока есть карты действия которые могут "
        "полоностью поменять ход игры. Их можно "
        "использовать в любой момент\n\n"
        "<b>ℹ️ Для более подробного описания перейти "
        'на вкладку "Правила игры 📜"</b>'
    ),
]
HELP_MESSAGE = (
    "1️⃣ Если ты не слышал об игре <b>Бункер</b>, "
    "тогда советую почитать описание и "
    "правила игры.\n\n"
    "2️⃣ Если ты знаешь правила и готов играть, то "
    "приглашай друзей и нажимай создать "
    "комнату. После этого тебе придет номер твоей "
    "комнаты с помощью которого "
    "твои друзья смогут зайти к тебе.\n\n"
    "3️⃣ Если ты хочешь зайти в комнату попроси владельца "
    "комнаты назвать тебе ее номер "
    "нажимай <b>Войти в комнату</b> и пиши этот номер, "
    "после того как ты это сделаешь "
    "тебя перебросит в выбранную комнату\n\n"
    "4️⃣ После того как все зашли владелец "
    "комнаты нажимает <b>Начать игру</b> и "
    "все получают сообщение с информацией о эпидемии, "
    "бункере и персонаже. "
    "Чтобы посмотреть достаточно просто нажимать на "
    "кнопки выбора информации.\n\n"
    "5️⃣ Если ты владелец комнаты у тебя появляется "
    "дополнительная кнопка Управление игрой. "
    "В которой ты можешь перезапускать или закрывать "
    "текущую игровую партию.\n\n"
    "❗️ В данный момент в игре не доступна игра с "
    "общением через телеграм. Поэтому собирайтесь с "
    "друзьями в заведении/доме/на природе "
    "или голосовом чате и начинайте Играть!"
)

RULES_MESSAGE = [
    (
        "<b>1️⃣ Введение</b>\n\n"
        "🗣 Ведущий рассказывает правила и запускает игру. \n\n"
        "👥 Все игроки узнают, какая случилась катастрофа "
        "и какой бункер находится рядом с ними. \n\n"
        "🃏 Каждый игрок получает карты с "
        "характеристиками своего персонажа.\n\n"
        "▶️ На старте игрок обезличен и вживается в своего персонажа "
        "постепенно, с каждым кругом. \n\n"
        "👤 У него нет пола, возраста и других категорий, "
        "пока он не откроет перед всеми игроками "
        "соответствующую характеристику."
    ),
    (
        "<b>2️⃣ Игровой круг</b>\n\n"
        "🗣 Каждый игрок по очереди озвучивает одну из "
        "своих карт и обосновывает свою необходимость "
        "попасть в бункер.\n\n"
        "🎓 В первый ход обязательно вскрывается Профессия "
        "игрока, во всех остальных "
        "на выбор игрока.\n\n"
        "✏️ Например, игроку 1 досталась "
        "профессия «Врач».\n"
        "Игрок 1:🗣 <b>«Я должен попасть в "
        "бункер, так как моя профессия просто необходима: "
        "когда мы выйдем из бункера, мы не перестанем "
        "болеть, получать травмы. Человек без специального "
        "образования не сможет помочь вам, необходимо избежать "
        "этого и взять меня в бункер»</b>\n\n"
        "⚠️ Все игроки высказываются по очереди. Важно в каждом "
        "круге оперировать только открытыми "
        "характеристиками, так как мы еще много "
        "чего не знаем о остальных персонажах."
    ),
    (
        "<b>3️⃣ Голосование</b>\n\n"
        "🗳 Голосование проходит каждый круг начиная "
        "с 5 (в зависимости от количества игроков "
        "за столом старт голосования может быть "
        "смещен как в меньшую, так и в большую сторону).\n\n"
        "🗣 После того как все игроки озвучили свои карты, "
        "время выдвинуть кандидатов на выбывание. Далее "
        "проходит общее голосование, и ещё один персонаж "
        "не попадает в спасительный бункер."
    ),
    (
        "<b>4️⃣ Заключение</b>\n\n"
        "🌏 Вы сделали свой выбор и знаете, кто попадает в "
        "бункер. У каждого игрока осталось по одной "
        "характеристике.\n\n"
        "🔚 Ведущий оглашает результат "
        "игры. В процессе игры вы можете задать ведущему "
        "любой вопрос по правилам, ведущий подскажет.\n\n"
        "<b>🍀 Хороших вам игр!</b>"
    ),
]

CREATE_ROOM_MESSAGE = "Комната успешно создана!\n"
NOT_CREATED_ROOM_MESSAGE = (
    "Ты уже находишься в комнате №{}\n И не можешь создать новую!\n"
)
USER_CANT_ENTER_ROOM = (
    "Ты уже находишься в комнате №{}!\n Для начала выйди из текущей комнаты.\n"
)
ENTER_ROOM_SLUG_MESSAGE = "Введи номер комнаты."
NO_ROOM_MESSAGE = "Комнаты с таким номером не существует!"
ROOM_STARTED_MESSAGE = "В данной комнате игра уже стартовала!"
USER_ENTERED_ROOM_MESSAGE = "Ты успешно зашел в комнату!"
USER_ENTERED_ROOM_ADMIN_MESSAGE = "{} зашел в комнату."
USER_LEAVE_ROOM_MESSAGE = "Ты вышел из комнаты."
CHARACTER_GET_MESSAGE = (
    "🎓 Профессия: <b>{}</b>\n"
    "🧑‍🦲 Био характеристики: <b>{} {} лет ({})</b>\n"
    "🏥 Состояние здоровья: <b>{}</b>\n"
    "🕷 Фобия: <b>{}</b>\n"
    "🎯 Хобби: <b>{}</b>\n"
    "😈 Характер: <b>{}</b>\n"
    "ℹ️ Доп. Информация: <b>{}</b>\n"
    "👝 Багаж: <b>{}</b>\n"
    "<b>↗️ Карты действия:</b>\n"
    "{}"
)
EPIDEMIA_GET_MESSAGE = (
    "🌋 В мире произошло: <b>{}</b>\n"
    "🥬 Припасов в бункере на: <b>{} лет(года)</b>"
)
BUNKER_GET_MESSAGE = (
    "🛖 Бункер: <b>{}</b>\n"
    "🪑 Мест в бункере: <b>{}</b>\n"
    "<b>Комнаты:</b>\n"
    "<b>{}</b>"
)
NOT_ENOUGH_PLAYERS_MESSAGE = (
    "Для начала игры требуется как минимум {} игрока(ов)."
)
GAME_STARTED_MESSAGE = (
    "Игра началась! Изучи своего персонажа и произошедшую катастрофу. Удачи"
)
ROOM_IS_CLOSED_MESSAGE = "Ваша комната была закрыта администратором - {}"
PLAYER_LEFT_ROOM_MESSAGE = "{} вышел из комнаты."
ROOM_GET_MESSAGE = "Комната №{}\n" "Количество игроков: {}" "{}"
YOU_LEFT_ROOM_MESSAGE = "Ты успешно вышел из комнаты №{}"
KICKED_USER_MESSAGE = "Тебя выгнали из комнаты"
MESSAGE_ABOUT_KICKED_PLAYER = "Администратор комнаты выгнал игрока - {}"
NOT_IN_ROOM_MESSAGE = "Вы не находитесь в комнате"
NO_GAME_MESSAGE = "Вы не находитесь в игре"
NOT_ADMIN_MESSAGE = "Вы не администратор комнаты"
GAME_SETTINGS_MESSAGE = "Игра №{}\n" "Количество игроков: {}\n" "{}"
GAME_CLOSED_MESSAGE = (
    "Игра была остановлена администратором. Вы были перенаправлены в комнату."
)
