START_MESSAGE = (
    "Привет, с помощью этого бота ты можешь сыграть с "
    "друзьями в аналог настольной игры Бункер"
)
CREATE_ROOM_MESSAGE = "Комната успешно создана!\n" "Номер комнаты: {}"
NOT_CREATED_ROOM_MESSAGE = (
    "Ты уже находишься в комнате №{} и не можешь создать новую!"
)
ENTER_ROOM_SLUG_MESSAGE = "Введи номер комнаты."
NO_ROOM_MESSAGE = "Комнаты с таким номером не существует!"
USER_ENTERED_ROOM_MESSAGE = "Ты успешно зашел в комнату!"
USER_ENTERED_ROOM_ADMIN_MESSAGE = "{} зашел в комнату."
USER_LEAVE_ROOM_MESSAGE = "Ты вышел из комнаты."
CHARACTER_GET_MESSAGE = (
    "Профессия: {}\n"
    "Пол: {} ({})\n"
    "Возраст: {}\n"
    "Состояние здоровья: {}\n"
    "Фобия: {}\n"
    "Хобби: {}\n"
    "Характер: {}\n"
    "Дополнительная информация: {}\n"
    "Багаж: {}\n"
    "Карта №1: {}\n"
    "Карта №2: {}"
)
EPIDEMIA_GET_MESSAGE = (
    "В мире произошло: {}\n"
    "До выхода на поверхность требуется прожить в бункере: {} лет(года)"
)
BUNKER_GET_MESSAGE = (
    "Ваш бункер: {}\n"
    "Количество мест в бункере: {}\n"
    "Комната №1: {}\n"
    "Комната №2: {}\n"
    "Комната №3: {}\n"
)
NOT_ENOUGH_PLAYERS_MESSAGE = (
    "Для начала игры требуется как минимум {} игрока(ов)."
)
GAME_STARTED_MESSAGE = (
    "Игра началась! Изучи своего персонажа и произошедшую катастрофу. Удачи"
)
ROOM_IS_CLOSED_MESSAGE = "Ваша комната была закрыта администратором - {}"
PLAYER_LEFT_ROOM_MESSAGE = "{} вышел из комнаты."
ROOM_GET_MESSAGE = "Комната №{}\n" "Количество игроков: {}\n" "{}"
YOU_LEFT_ROOM_MESSAGE = "Ты успешно вышел из комнаты №{}"
KICKED_USER_MESSAGE = "Тебя выгнали из комнаты"
MESSAGE_ABOUT_KICKED_PLAYER = "Администратор комнаты выгнал игрока - {}"
